
// Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// System.Console.Write("Введите первое число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// System.Console.Write("Введите второе число: ");
// int b = Convert.ToInt32(Console.ReadLine());

// System.Console.WriteLine(Math.Pow(a,b));


//Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.


// System.Console.WriteLine("Введите число: ");
// int num = Convert.ToInt32(Console.ReadLine());

// int SumDigit(int n){
// int count = 0;

// while(num>0){
//     count++;
//     num /= 10;
// }
// return count;
// }

// System.Console.WriteLine(SumDigit(num));

